package 复习

/**
 * @ 文件名:   `01.for与foreach`
 * @ 创建者:   Eason
 * @ 时间:    2018/8/6 16:17
 * @ 描述:"abcdefghijkl"
 */
fun main(args: Array<String>) {
    val s = "abcdefghijkl"
/*========================== for循环==========================*/
    for (c in s) {
        println(c)
    }
    println("/*========================== ==========================*/")

/*========================== for循环加上角标==========================*/
    for ((index, c) in s.withIndex()) {
        println("$index,$c")
    }
    println("/*========================== ==========================*/")

/*========================== foreach循环==========================*/
    s.forEach { println(it) }
    println("/*========================== ==========================*/")

/*========================== foreach循环加上角标==========================*/
    s.forEachIndexed { index, c -> println("$index,$c") }
    println("/*========================== ==========================*/")
}