package 复习

/**
 * @ 文件名:   `11.数组角标`
 * @ 创建者:   Eason
 * @ 时间:    2018/8/6 16:39
 * @ 描述:"张三","李四","张四","王五","张三","赵六"
 */
fun main(args: Array<String>) {
    val arr = arrayOf("张三", "李四", "张四", "王五", "张三", "赵六")

/*========================== 查找第一个“张三”角标==========================*/
    println(arr.indexOf("张三"))

/*========================== 查找最后一个“张三”角标==========================*/
    println(arr.lastIndexOf("张三"))

/*========================== 查找第一个姓“张”的人的角标==========================*/
    println(arr.indexOfFirst { it.startsWith("张") })

/*========================== 查找最后一个姓“张”的人的角标==========================*/
    println(arr.indexOfLast { it.startsWith("张") })
}
