package 复习.高阶函数及调用

/**
 * @ 文件名:   `05.高阶函数及调用`
 * @ 创建者:   Eason
 * @ 时间:    2018/8/11 16:57
 * @ 描述:
 *      写一个有两个参数及一个函数参数的高级函数
 *      调用高级函数，实现相加，相减
 */

/*========================== 写一个两个数相加的函数==========================*/
fun add(a: Int, b: Int) = a + b

/*========================== 写一个两个数相减的函数==========================*/
fun sub(a: Int, b: Int) = a - b

/*========================== 写一个有两个参数及一个函数参数的高级函数==========================*/
fun result(a: Int, b: Int, block: (Int, Int) -> Int): Int {//导入了一个int双参int返回值的函数
    return block(a, b)//返回block函数结果
}

fun main(args: Array<String>) {
    val a = 10
    val b = 5
    println(result(a, b, ::add))
    println(result(a, b, ::sub))
}

    