package 复习.高阶函数lambda

/**
 * @ 文件名:   `06.高阶函数lambda`
 * @ 创建者:   Eason
 * @ 时间:    2018/8/11 16:59
 * @ 描述:将05中的高阶函数转化成只执行一次的lambda表达式，去除add()、sub()
 */

/*========================== 写一个两个数相加的函数==========================*/

/*========================== 写一个两个数相减的函数==========================*/

/*========================== 写一个有两个参数及一个函数参数的高级函数==========================*/
fun result(a: Int, b: Int, block: (Int, Int) -> Int): Int {//导入了一个int双参int返回值的函数
    return block(a, b)//返回block函数结果
}

fun main(args: Array<String>) {
    val a = 10
    val b = 5
//    result(a, b, { m, n -> m + n })
/*========================== lambda简化==========================*/
//    result(a, b) { m, n -> m + n }
    println(result(a, b) { m, n -> m + n })
    println(result(a, b) { m, n -> m - n })

}



