package 复习.独立lambda表达式

/**
 * @ 文件名:   `07.独立lambda表达式`
 * @ 创建者:   Eason
 * @ 时间:    2018/8/11 17:03
 * @ 描述:
 */
fun main(args: Array<String>) {
/*========================== 无参无返回==========================*/
    {
        println("无参无返回")
    }()
/*========================== 无参有返回==========================*/
    val s =
            {
                "无参有返回"
            }.invoke()
    println(s)
/*========================== 有参无返回==========================*/
    val zs = "分隔符"
    { a: Int, b: Int ->
        println("有参无返回")
    }(10, 20)
/*========================== 有参有返回==========================*/
    val s1 = { a: Int, b: Int ->
        "有参有返回"
    }(10, 20)
    println(s1)
}
